app/views/static_pages/home.html.erb

	<% if @comments && @comments.any? %>
	  <h2>Comments (<%= @comments.size %> of <%= Comment.all.size %>):</h2>
---
SELECT "comments".* FROM "comments"
SELECT COUNT(*) FROM "comments"