app/views/comments/index.html.erb

SELECT "comments".* FROM "comments"
---
	<% if @comments && @comments.any? %>
	  <h2>Comments (<%= @comments.size %> of <%= Comment.all.size %>):</h2>