app/controllers/comments_controller.rb

  def create
    #@comments = Comment.all
    @comment = Comment.new(params[:comment])
    if (@comment.save)
      redirect_to root_url
    else
      @comments = Comment.paginate(:page => params[:page],
        :per_page => 5,
        :order => "created_at DESC")
---
INSERT INTO "comments" ("content", "created_at", "email", "name", "updated_at") VALUES ('Unfortunately it only allows 10 accounts in demo, so I had to pick and choose which accounts to activate. I mainly put the developers and designers in there because it''s their documentation that we need to start capturing.
SELECT "comments".* FROM "comments" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments"

  def destroy
    raise params.inspect
    Comment.find(params[:id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 LIMIT 1