app/controllers/rsvps_controller.rb

  def index
    @rsvps = Rsvp.all
---
SELECT "rsvps".* FROM "rsvps"

  def show
    @rsvp = Rsvp.find(params[:id])
---
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."id" = 2 LIMIT 1

  def edit
    @rsvp = Rsvp.find(params[:id])
---
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."id" = 18 LIMIT 1

  def create
    @rsvp = Rsvp.new(params[:rsvp])

    #respond_to do |format|
    if @rsvp.save
---
INSERT INTO "rsvps" ("created_at", "email", "name", "num_persons", "special", "updated_at", "will_attend") VALUES ('2013-06-21 19:46:02', 'ergesgwgwg', 'Taras and his giant army', 9999001, 'Yeah, I want to be seated next to some hot chicks, okay? But not too hot, that makes me nervous.', '2013-06-21 19:46:02', 't') RETURNING "id"

  def update
    @rsvp = Rsvp.find(params[:id])

    respond_to do |format|
      if @rsvp.update_attributes(params[:rsvp])
---
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."id" = 18 LIMIT 1
UPDATE "rsvps" SET "name" = 'drthbnsrf', "email" = 'bsbdfxfrhsrdfb', "num_persons" = 0, "special" = 'dfnbsxdgnxfg', "updated_at" = '2013-06-21 20:05:41' WHERE "rsvps"."id" = 18