app/controllers/static_pages_controller.rb

  def home
      @comments = Comment.paginate(:page => params[:page],
        :per_page => 5,
        :order => "created_at DESC")
---
SELECT "comments".* FROM "comments" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments"